app/controllers/items_controller.rb

  def index
    order = params[:order] || "name"
    @items = Item.all.order(order)
---
SELECT "items".* FROM "items" ORDER BY deliverable

  def show
    if params[:id]
      @item = Item.find(params[:id])
      @seller = User.find(@item.user_id).name
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

  def create
    params[:item][:status] = "available"
    i = current_user.items.build(item_params)
    current_user.items << i
    if i.valid?
      i.image.attach(params[:item][:image])
---
INSERT INTO "items" ("name", "price", "description", "status", "deliverable", "user_id", "created_at", "updated_at", "category") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "items" ("name", "price", "description", "status", "deliverable", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def search
    if !params[:search].empty?
      @phrase = params[:search]
      @items = Item.all.where("lower(name) LIKE :phrase", phrase: @phrase)
---
SELECT "items".* FROM "items" WHERE (lower(name) LIKE 'k' OR lower(category) LIKE 'k' OR lower(description) LIKE 'k')

  def send_interest_email
    logger.debug("HERE")
    logger.debug(params)
    @item = Item.find(params[:id])
    @seller = User.find(@item.user_id)
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]