app/controllers/items_controller.rb

UPDATE "items" SET "updated_at" = ? WHERE "items"."id" = ?  [["updated_at", "2020-11-15 04:21:43.846909"], ["id", 18]]
---
  def update
    @item = Item.find(params[:id])
    if (current_user.items.include?(@item) and @item.update_attributes(item_params))

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def send_interest_email
    # will refactor in next iteration
    @item = Item.find(params[:id])