app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "payment" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "mimi"], ["payment", "venmo"], ["updated_at", "2020-11-21 03:14:28.549772"], ["id", 20]]