app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "mgrigoryan@colgate.edu"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "created_at", "updated_at", "encrypted_password") VALUES (?, ?, ?, ?)
---
  def self.from_omniauth(access_token)
      data = access_token.info
      user = User.where(email: data['email']).first

      unless user
          user = User.create(email: data['email'],
          name: data['name'],
              password: Devise.friendly_token[0,20]
          )